hcl/docs/README.html
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>README</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-12-05 10:18:45 EST"/>
<meta name="author" content="Sam"/>
</head><body>
<h1 class="title">README</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 HOT COCOA LISP </a>
<ul>
<li><a href="#sec-1.1">1.1 High Level Design Goals </a></li>
<li><a href="#sec-1.2">1.2 Concerns </a></li>
<li><a href="#sec-1.3">1.3 Javascript objects </a>
<ul>
<li><a href="#sec-1.3.1">1.3.1 literal notation </a></li>
<li><a href="#sec-1.3.2">1.3.2 access notation </a></li>
<li><a href="#sec-1.3.3">1.3.3 method notation </a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">1 HOT COCOA LISP </h2>
<div id="text-1">

<p>Hot Cocoa Lisp is a dialect of Lisp designed to be compiled into or
interpreted in Javascript.  It has been said that Javascript is
Scheme in C's Clothes.  Hot Cocoa Lisp is an attempt to put it back
in Schemes clothes.
</p>
</div>

<div id="outline-container-1.1" class="outline-3">
<h3 id="sec-1.1">1.1 High Level Design Goals </h3>
<div id="text-1.1">

<ul>
<li>
Provide a clean, intuitive interface to existing
Javascript libraries/frameworks
</li>
<li>
Use the minimal syntax of Lisp
</li>
<li>
Retain the good features of Javascript
(first-class functions with closures, Dynamic objects with prototypes,
Object literals).
</li>
<li>
Leave out the bad features of Javascript.
(Global variables, type coersion, etc.)
</li>
</ul>
</div>

</div>

<div id="outline-container-1.2" class="outline-3">
<h3 id="sec-1.2">1.2 Concerns </h3>
<div id="text-1.2">

<p>One of the major questions I still have is where my compiler will fall
between two particular extremes.  The first extreme is to simply generate
a Lisp parse tree, define eval (and realistically a few other things) in
Javascript, and simply run eval on the parse tree.  The second extreme is
generating Javascript code that looks nothing like the HCL code it came
from.  Because I'm not terribly interested in diving down the rabbit hole
of compiler optimization, I suspect I will fall a bit closer to the former.
</p>
<p>
Another concern I have is how exactly I want to handle including code from
other files.  In code targeted at node, the node "require" method should work
fine:
</p>
<pre class="example">
var lib = require("./lib.js")
</pre>

<p>
could become
</p>
<pre class="example">
(define lib (require "./lib.hcl"))
</pre>

<p>
and in theory, I could even include source files from Javascript <i>or</i> HCL
this way by looking at the file extension.  One possibility for browser
implementations is creating an analogous require function that loads source
libraries via AJAX and compiles them in the browser.  Alternately, multiple
compiled HCL files could be loaded via separate script tags and one could be
designated the "main" one (through a compiler directive or the like) and be
would then be able to access the others via a require method.
</p>
</div>

</div>

<div id="outline-container-1.3" class="outline-3">
<h3 id="sec-1.3">1.3 Javascript objects </h3>
<div id="text-1.3">

<p>To fascilitate interoperability, HCL objects work almost exactly
the same as Javascript objects with a few exceptions.
</p>

</div>

<div id="outline-container-1.3.1" class="outline-4">
<h4 id="sec-1.3.1">1.3.1 literal notation </h4>
<div id="text-1.3.1">

<p>Object literals can declared in one of two ways:
</p>
<pre class="example">
{a 1 b 2}
</pre>

<p>
OR
</p>
<pre class="example">
(object a 1 b 2)
</pre>

<p>
The first is translated by the parser into the second.  In either
case an even number of arguments is expected and they interpreted
pairwise as key-value pairs.
</p>
</div>

</div>

<div id="outline-container-1.3.2" class="outline-4">
<h4 id="sec-1.3.2">1.3.2 access notation </h4>
<div id="text-1.3.2">

<ul>
<li id="sec-1.3.2.1">Getting <br/>
The simplest way to access a property of an object is using the
familiar dotted notation from Javascript:

<pre class="example">
obj.key
</pre>

<p>
Or the more lisp-like:
</p>
<pre class="example">
(. obj key)
</pre>

<p>
As before the first is translated to the second by the parser.
</p>
<p>
Access in this form can also be chained (e.g.):
</p>
<pre class="example">
obj.key1.key2
(. obj key1 key2)
</pre>

<p>
The first argument of <i>.</i> can be either a symbol bound to an
object in scope or an list expression evaluating to an object:
</p>
<pre class="example">
(. (expression-evaluating-to-object) key)
(expression-evaluating-to-object).key
</pre>

<p>
where <i>obj.key1</i> is another object that has the key <i>key2</i>. Just
like the dotted notation in Javascript, this notation only works
when you know the names of the keys before runtime.  If the name
of the key is the result of a computation then you can use the
<i>get</i> function:
</p>
<pre class="example">
(get obj "key")
(get obj 'key)
(get obj (expression-evaluating-to-key))
</pre>

<p>
Unlike the <i>.</i> special form, <i>get</i> evaluates all of it's
arguments and is equivalent to the javascript square bracket
notation.
</p>
</li>
<li id="sec-1.3.2.2">Setting <br/>
When the <i>set</i> special form takes an object as it's first a key
as its second and a value as it's third.  All three arguments are
evaluated.

<pre class="example">
(set obj 'key value)
(set obj (expression-evaluatin-to-key) value)
</pre>

</li>
</ul>
</div>

</div>

<div id="outline-container-1.3.3" class="outline-4">
<h4 id="sec-1.3.3">1.3.3 method notation </h4>
<div id="text-1.3.3">

<p>When a property of an object is a function and it is accessed
using the <i>.</i> special form, it is returned with a wrappper
function that calls the function context of the object.  This
ensures that <i>this</i> will refer to <i>obj</i> in the context of a the
call:
</p>
<pre class="example">
(obj.method args..)
</pre>

<p>
When a function is accessed via <i>get</i>, it is returned normally
without a wrapper.
</p>
<p>
Additionally functions can be called using <i>call</i> and <i>apply</i>
which specify a context to referred to by <i>this</i>:
</p>
<pre class="example">
(call method context args..)
(apply method context arg-list)
</pre>

<p>
Wrapped functions will have their call and apply methods
overridden to make them work correctly with call and apply.
</p></div>
</div>
</div>
</div>
<div id="postamble"><p class="author"> Author: Sam
<a href="mailto:sam@accepted">&lt;sam@accepted&gt;</a>
</p>
<p class="date"> Date: 2012-12-05 10:18:45 EST</p>
<p>HTML generated by org-mode 6.21b in emacs 23</p>
</div></body>
</html>
